In [2]:
# separated by comma
# Pandas for manupulate
# Data frame storing 2D

In [6]:
b = open("data.csv","x")
b.close()

In [2]:
b = open("data.csv","r")
print(b.read())
b.close()

SN,Name,Age,Address
1,Ram,23,Kathmandu
2,Shyam,45,Bara
3,Nabin,54,Pokhara
4,Santosh,45,Slolu
5,Aayush,64,KTM
6,Hari,43,Jhapa

In [1]:
import pandas as pd
df = pd.read_csv("data.csv")
df

   SN     Name  Age    Address
0   1      Ram   23  Kathmandu
1   2    Shyam   45       Bara
2   3    Nabin   54    Pokhara
3   4  Santosh   45      Slolu
4   5   Aayush   64        KTM
5   6     Hari   43      Jhapa

In [3]:
import pandas as pd
df = pd.read_csv("data.csv",nrows = 5)
df

   SN     Name  Age    Address
0   1      Ram   23  Kathmandu
1   2    Shyam   45       Bara
2   3    Nabin   54    Pokhara
3   4  Santosh   45      Slolu
4   5   Aayush   64        KTM

In [5]:
import pandas as pd
df = pd.read_csv("data.csv")
df.head(3)

   SN   Name  Age    Address
0   1    Ram   23  Kathmandu
1   2  Shyam   45       Bara
2   3  Nabin   54    Pokhara

In [6]:
import pandas as pd
df = pd.read_csv("data.csv")
df.tail(3)

   SN     Name  Age Address
3   4  Santosh   45   Slolu
4   5   Aayush   64     KTM
5   6     Hari   43   Jhapa

In [7]:
import pandas as pd
df = pd.read_csv("data.csv",index_col = "SN") #serial number
df

       Name  Age    Address
SN
1       Ram   23  Kathmandu
2     Shyam   45       Bara
3     Nabin   54    Pokhara
4   Santosh   45      Slolu
5    Aayush   64        KTM
6      Hari   43      Jhapa

In [8]:
import pandas as pd
df = pd.read_csv("data.csv",index_col = "SN",usecols = ["SN","Name","Age"]) #small data r
df

       Name  Age
SN
1       Ram   23
2     Shyam   45
3     Nabin   54
4   Santosh   45
5    Aayush   64
6      Hari   43

In [11]:
import pandas as pd
df = pd.read_csv("data.csv",index_col = "SN") #data filtering
df["Age"]

SN
1    23
2    45
3    54
4    45
5    64
6    43
Name: Age, dtype: int64

In [12]:
import pandas as pd
df = pd.read_csv("data.csv",index_col = "SN") #data filtering
df["Age"]>40

SN
1    False
2     True
3     True
4     True
5     True
6     True
Name: Age, dtype: bool

In [13]:
import pandas as pd
df = pd.read_csv("data.csv",index_col = "SN") #data filtering
df[df["Age"]>45]

      Name  Age  Address
SN
3    Nabin   54  Pokhara
5   Aayush   64      KTM

In [14]:
import pandas as pd
df = pd.read_csv("data.csv",index_col = "SN") #data filtering
df[df["Address"] == "KTM"]

      Name  Age Address
SN
5   Aayush   64     KTM

In [5]:
import pandas as pd
df = pd.read_csv('data.csv',index_col = "SN")
df[(df['Address'] == "Bara") & (df['Age']>40)]

     Name  Age Address
SN
2   Shyam   45    Bara

In [12]:
import pandas as pd
df = pd.read_csv("data.csv",index_col = "SN") #data filtering
df[(df['Address'] == "Bara") & (df["Age"]>4)]

     Name  Age Address
SN
2   Shyam   45    Bara

In [24]:
import pandas as pd
df = pd.read_csv("data.csv",index_col = "SN")
df.iloc[0:4,0:2]

       Name  Age
SN
1       Ram   23
2     Shyam   45
3     Nabin   54
4   Santosh   45

In [3]:
import pandas as pd
df = pd.read_csv("data.csv",index_col = "SN") #row on the basis of index
df.iloc[0:4]

       Name  Age    Address
SN
1       Ram   23  Kathmandu
2     Shyam   45       Bara
3     Nabin   54    Pokhara
4   Santosh   45      Slolu

In [4]:
import pandas as pd
df = pd.read_csv("data.csv",index_col = "SN") #on the basis of value
df.loc[2:5]

       Name  Age  Address
SN
2     Shyam   45     Bara
3     Nabin   54  Pokhara
4   Santosh   45    Slolu
5    Aayush   64      KTM

In [5]:
import pandas as pd
df = pd.read_csv("data.csv",index_col = "Name") #on the basis of name for only unique
df.loc['Nabin':'Aayush']

         SN  Age  Address
Name
Nabin     3   54  Pokhara
Santosh   4   45    Slolu
Aayush    5   64      KTM

In [2]:
df.drop(["Santosh"], axis = 0)

NameError: name 'df' is not defined

In [1]:
df.drop(["Address"], axis = 1)

NameError: name 'df' is not defined

In [11]:
import pandas as pd
df = pd.read_csv("data.csv",index_col = "Name") #on the basis of name for only unique
fd = df['Nabin':'Aayush']

fd.to_csv("filtered_data.csv")

In [9]:
import csv
fields = ['Kamal',28,'Baluwatar']
with open('books.csv','a') as f: #new way to open not necessory to close
    x = csv.writer(f)
    x.writerow(fields)

In [20]:
#or
import csv
fields = ['Kamal',28,'Baluwatar']
f = open('books.csv','a') #open
x = csv.writer(f) #object made
x.writerow(fields)
f.close()

In [14]:
result = []
n = int(input("Enter n = "))
for i in range(1,n+1):
    name = input("Enter name = ")
    physics = int(input("Enter marks"))
    chemistry = int(input("Enter marks"))
    math = int(input("Enter marks"))
    english = int(input("Enter marks"))
    total = sum([physics,chemistry,math,english])
    per = total/4
    marks = [i,name,physics,chemistry,math,english,total,per]
    result.append(marks)
print(result)

Enter n = 2
Enter name = ram
Enter marks25
Enter marks25
Enter marks36
Enter marks65
Enter name = Hari
Enter marks26
Enter marks35
Enter marks65
Enter marks56
[[1, 'ram', 25, 25, 36, 65, 151, 37.75], [2, 'Hari', 26, 35, 65, 56, 182, 45.5]]

In [21]:
import csv
f = open('result.csv','w') #direct lekhda ni hunxa
x = csv.writer(f)
for i in result:
    x.writerow(i)
f.close()

In [22]:
import csv
f = open('result.csv','w') #direct lekhda ni hunxa
x = csv.writer(f)
x.writerow(["SN","Name","Physics","Chemistry","Math","English","Total","Percentage"])
for i in result: #header
    x.writerow(i)
f.close()

In [23]:
import pandas as pd
df = pd.read_csv("result.csv") #data view
df

   SN  Name  Physics  Chemistry  Math  English  Total  Percentage
0   1   ram       25         25    36       65    151       37.75
1   2  Hari       26         35    65       56    182       45.50

In [25]:
import pandas as pd 
df = pd.read_csv("result.csv",index_col = "SN")
df

    Name  Physics  Chemistry  Math  English  Total  Percentage
SN
1    ram       25         25    36       65    151       37.75
2   Hari       26         35    65       56    182       45.50

In [28]:
a = {'Santosh': ['9865623658', '9865986586'], 'Ram': ['9685689575', '9856895648']}
df = pd.DataFrame(a)
df

      Santosh         Ram
0  9865623658  9685689575
1  9865986586  9856895648

In [29]:
a = {'Santosh': ['9865623658', '9865986586'], 'Ram': ['9685689575', '9856895648']}
df = pd.DataFrame(a) #purified data of dictionary key equal to column
df.to_csv('Phone.csv')

In [30]:
import pandas as pd
df = pd.read_csv('Phone.csv')
df

   Unnamed: 0     Santosh         Ram
0           0  9865623658  9685689575
1           1  9865986586  9856895648

In [31]:
import csv
b = open('filtered_data.csv') #dictreader
reader = csv.DictReader(b) #without pandas read for update delete
for row in reader:
    print(row)

{'Name': 'Nabin', 'SN': '3', 'Age': '54', 'Address': 'Pokhara'}
{'Name': 'Santosh', 'SN': '4', 'Age': '45', 'Address': 'Slolu'}
{'Name': 'Aayush', 'SN': '5', 'Age': '64', 'Address': 'KTM'}

In [34]:
import csv
b = open('filtered_data.csv')
reader = csv.DictReader(b)

for row in reader:
    print(dict(row))

{'Name': 'Nabin', 'SN': '3', 'Age': '54', 'Address': 'Pokhara'}
{'Name': 'Santosh', 'SN': '4', 'Age': '45', 'Address': 'Slolu'}
{'Name': 'Aayush', 'SN': '5', 'Age': '64', 'Address': 'KTM'}

In [35]:
import pandas as pd
df = pd.read_csv('filtered_data.csv') #
df

      Name  SN  Age  Address
0    Nabin   3   54  Pokhara
1  Santosh   4   45    Slolu
2   Aayush   5   64      KTM

In [36]:
import csv #for update
final_data=[]
b = open('filtered_data.csv')
reader = csv.DictReader(b)

for row in reader:
    final_data.append(dict(row))
print(final_data)

[{'Name': 'Nabin', 'SN': '3', 'Age': '54', 'Address': 'Pokhara'}, {'Name': 'Santosh', 'SN': '4', 'Age': '45', 'Address': 'Slolu'}, {'Name': 'Aayush', 'SN': '5', 'Age': '64', 'Address': 'KTM'}]

In [39]:
final_data[0]["Name"] = "Ramprasad"
final_data

[{'Name': 'Ramprasad', 'SN': '3', 'Age': '54', 'Address': 'Pokhara'},
 {'Name': 'Santosh', 'SN': '4', 'Age': '45', 'Address': 'Slolu'},
 {'Name': 'Aayush', 'SN': '5', 'Age': '64', 'Address': 'KTM'}]

In [42]:
import csv #dictwriter mathiko update
csv_columns = ['Name', 'SN', 'Age','Address']
dict = final_data

b = open("filtered_data.csv", 'w')
writer = csv.DictWriter(b, fieldnames=csv_columns)
writer.writeheader() #column entry
for data in dict:
    writer.writerow(data)
b.close()

In [43]:
import pandas as pd
df = pd.read_csv('filtered_data.csv') #due to long process required databse
df

        Name  SN  Age  Address
0  Ramprasad   3   54  Pokhara
1    Santosh   4   45    Slolu
2     Aayush   5   64      KTM